In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df['States'] = "CA NV AZ".split()
df.set_index('States',inplace=True)

In [3]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## Dropping row or columns based on the nan values

In [4]:
df.dropna(axis=0)
## here i am giving axis = 0 hence it will drop the rows that have nan values

          A    B  C
States
CA      1.0  5.0  1

In [5]:
df.dropna(axis=1)
# ## here i am giving axis = 1 hence it will drop the columns that have nan values

        C
States
CA      1
NV      2
AZ      3

In [6]:
df.dropna(thresh=2)
## Here what happens when thresh is 2 then what happens is if the row contains less that 2 NON-NAN values then it 
## will be dropped

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [8]:
df.dropna(thresh=2)
## here as you can see the rows are not getting dropped since the thresh is 1 and there is atleast one NON_NAN values
## in the dataframe

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2

In [9]:
df

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  NaN  2
AZ      NaN  NaN  3

## we have null values in the dataframe and now we should fill them using fillna

In [11]:
df.fillna(value="Fill value")
## here in place of value you can give whatever you want the NAN values to be filled with.

                 A           B  C
States
CA             1.0         5.0  1
NV             2.0  Fill value  2
AZ      Fill value  Fill value  3

## we will fill the null values by mean of column A

In [12]:
df.fillna(value=df['A'].mean())
## you can see below that the va

          A    B  C
States
CA      1.0  5.0  1
NV      2.0  1.5  2
AZ      1.5  1.5  3